//=============================================================================
//
// 当たり判定処理 [checkhit.h]
// Author : 朱文渊
// プログラム作成日 : 2018/3/09
//
//=============================================================================
#ifndef _CHECKHIT_H_
#define _CHECKHIT_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
bool CheckHitBC(D3DXVECTOR3 pos1, D3DXVECTOR3 pos2, float radius1, float radius2);
void CheckHitPaE(void);
#endif