//=============================================================================
//
// フェード処理 [fade.h]
// Author : 眞戸原史也
// プログラム作成日 : 2018/3/09
//
//=============================================================================

// 多重インクルード防止の為
#ifndef _FADE_H_
#define _FADE_H_

// ライブラリ使用の為
#include "main.h"

// フェード制御マクロ
typedef enum
{
	FADE_NONE = 0,						// 何もない状態
	FADE_IN,							// フェードイン処理
	FADE_OUT,							// フェードアウト処理
	FADE_MAX
} FADE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitFade(void);					// 初期化処理関数
void UninitFade(void);					// 終了処理関数
void UpdateFade(void);					// 更新処理関数
void DrawFade(void);					// 描画処理関数

void SetFade(FADE fade);				// フェード状態設定関数
FADE GetFade(void);						// フェード状態取得関数

#endif
